---
kind: method
id: M:Autodesk.Revit.DB.Transaction.Dispose
zh: 事务
source: html/58d38d85-06cb-58ad-3631-8c2301240c94.htm
---
# Autodesk.Revit.DB.Transaction.Dispose Method

**中文**: 事务

Releases all resources used by the Transaction

## Syntax (C#)
```csharp
public void Dispose()
```